tap "lihaoyun6/tap"
tap "teamookla/speedtest"
tap "thusvill/livewallpaper"
brew "apktool"
brew "btop"
brew "cloc"
brew "coreutils"
brew "eza"
brew "ffmpeg"
brew "folderify"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "grep"
brew "iperf3"
brew "python@3.14"
brew "magic-wormhole"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "ollama"
brew "powerlevel10k"
brew "python-tk@3.14"
brew "python-yq"
brew "rclone"
brew "scrcpy"
brew "stow"
brew "tailscale"
brew "tokei"
brew "wget"
brew "yt-dlp"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "airbattery"
cask "android-platform-tools"
cask "android-studio"
cask "antigravity"
cask "anydesk"
cask "arc"
cask "ayugram"
cask "balenaetcher"
cask "betaflight-configurator"
cask "blockbench"
cask "checkra1n"
cask "cursor"
cask "discord"
cask "drivedx"
cask "epic-games"
cask "figma"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "gyroflow"
cask "keka"
cask "linear-linear"
cask "livewallpaper"
cask "lm-studio"
cask "macdroid"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "modrinth"
cask "notion"
cask "notion-calendar"
cask "nvidia-geforce-now"
cask "obs"
cask "orbstack"
cask "raspberry-pi-imager"
cask "raycast"
cask "sf-symbols"
cask "soduto"
cask "sublime-text"
cask "tableplus"
cask "tailscale-app"
cask "tunnelbear"
cask "utm"
cask "vesktop"
cask "whatsapp"
cask "zen"
vscode "a5hk.night-coder"
vscode "adpyke.codesnap"
vscode "biomejs.biome"
vscode "blockceptionltd.blockceptionvscodeminecraftbedrockdevelopmentextension"
vscode "bradlc.vscode-tailwindcss"
vscode "codezombiech.gitignore"
vscode "eamodio.gitlens"
vscode "eenaree.webstorm-new-dark"
vscode "figma.figma-vscode-extension"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "levertion.mcjson"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "nextbook.file-and-folder-icons"
vscode "oracle.oracle-java"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sakata.night-owl-colorful-html"
vscode "stevertus.mcscript"
vscode "third774.paper-owl"
vscode "vincaslt.highlight-matching-tag"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "weiyuwang.dark-plus-oled"
vscode "yoavbls.pretty-ts-errors"
